# Electrical System Cable Type Property

Source: https://www.revitapidocs.com/2026/4e65c486-46d0-f5ee-b79d-6ccab8a3d9b6.htm

---

| Electrical System Cable Type Property |
| --- |

The Cable Type of the Electrical System.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId CableType { get; set; }
```

```
Public Property CableType As ElementId
	Get
	Set
```

```
public:
property ElementId^ CableType {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

```
member CableType : ElementId with get, set
```

#### Property Value

ElementId Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The id is not a Cable Type id nor invalidElementId. |
| ArgumentNullException | When setting this property: A non\-optional argument was null |

Remarks After Cable Type of the Electrical System changes, the Cable Size will be set to InvalidElementId after regeneration. See Also

#### Reference

ElectricalSystem Class Autodesk.Revit.DB.Electrical Namespace